luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxLmu_bf.h
/** \brief  Length for Ifx_LMU_MEMCON_Bits.ERERR */
#define IFX_LMU_MEMCON_ERERR_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.ERERR */
#define IFX_LMU_MEMCON_ERERR_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.ERERR */
#define IFX_LMU_MEMCON_ERERR_OFF (3u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.ERRDIS */
#define IFX_LMU_MEMCON_ERRDIS_OFF (9u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.EWERR */
#define IFX_LMU_MEMCON_EWERR_OFF (5u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.INTERR */
#define IFX_LMU_MEMCON_INTERR_OFF (2u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.OLDAEN */
#define IFX_LMU_MEMCON_OLDAEN_OFF (0u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.PMIC */
#define IFX_LMU_MEMCON_PMIC_OFF (8u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.POLDAEN */
#define IFX_LMU_MEMCON_POLDAEN_OFF (1u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_LEN (1u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.RMWERR */
#define IFX_LMU_MEMCON_RMWERR_OFF (4u)

/** \brief  Length for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_LEN (4u)

/** \brief  Mask for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_MSK (0xfu)

/** \brief  Offset for Ifx_LMU_MEMCON_Bits.WSTATES */
#define IFX_LMU_MEMCON_WSTATES_OFF (12u)

/** \brief  Length for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_LEN (32u)

/** \brief  Mask for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_MSK (0xffffffffu)

/** \brief  Offset for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_OFF (0u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENA_EN0_OFF (0u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENA_EN10_OFF (10u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENA_EN11_OFF (11u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENA_EN12_OFF (12u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENA_EN13_OFF (13u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENA_EN14_OFF (14u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENA_EN15_OFF (15u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENA_EN16_OFF (16u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENA_EN17_OFF (17u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENA_EN18_OFF (18u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENA_EN19_OFF (19u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENA_EN1_OFF (1u)

