luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxLmu_bf.h
/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENA_EN20_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENA_EN20_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENA_EN20_OFF (20u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENA_EN21_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENA_EN21_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENA_EN21_OFF (21u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENA_EN22_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENA_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENA_EN22_OFF (22u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENA_EN23_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENA_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENA_EN23_OFF (23u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENA_EN24_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENA_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENA_EN24_OFF (24u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENA_EN25_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENA_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENA_EN25_OFF (25u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENA_EN26_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENA_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENA_EN26_OFF (26u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENA_EN27_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENA_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENA_EN27_OFF (27u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENA_EN28_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENA_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENA_EN28_OFF (28u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENA_EN29_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENA_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENA_EN29_OFF (29u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENA_EN2_OFF (2u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENA_EN30_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENA_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENA_EN30_OFF (30u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENA_EN31_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENA_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENA_EN31_OFF (31u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENA_EN3_OFF (3u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENA_EN4_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENA_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENA_EN4_OFF (4u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENA_EN5_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENA_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENA_EN5_OFF (5u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENA_EN6_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENA_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENA_EN6_OFF (6u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENA_EN7_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENA_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENA_EN7_OFF (7u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENA_EN8_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENA_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENA_EN8_OFF (8u)

/** \brief  Length for Ifx_LMU_RGN_ACCENA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENA_EN9_LEN (1u)

/** \brief  Mask for Ifx_LMU_RGN_ACCENA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENA_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_LMU_RGN_ACCENA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENA_EN9_OFF (9u)

/** \brief  Length for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_LEN (23u)

/** \brief  Mask for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_MSK (0x7fffffu)

/** \brief  Offset for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_OFF (5u)

/** \brief  Length for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_LEN (24u)

/** \brief  Mask for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_MSK (0xffffffu)

/** \brief  Offset for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_OFF (5u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXLMU_BF_H */
